#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/run.googleapis.com]
google_compute_network.vpc_network: Refreshing state... [id=projects/practice-cicd-mtk/global/networks/cicd-network]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/containerregistry.googleapis.com]
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/compute.googleapis.com]
google_cloud_run_service.api-run: Refreshing state... [id=locations/us-central1/namespaces/practice-cicd-mtk/services/api-run]
google_compute_firewall.develop: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/ssh-firewall]
google_compute_firewall.frontend: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/http-firewall]
google_compute_instance.nginx_instance: Refreshing state... [id=projects/practice-cicd-mtk/zones/us-central1-c/instances/reverse-proxy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_cloud_run_service.api-run has been changed
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/practice-cicd-mtk/services/api-run"
        name     = "api-run"
        # (3 unchanged attributes hidden)


      ~ template {

          ~ spec {
                # (1 unchanged attribute hidden)

              ~ containers {
                  + args    = []
                  + command = []
                    # (1 unchanged attribute hidden)

                  ~ resources {
                      + requests = {}
                        # (1 unchanged attribute hidden)
                    }
                }
            }
            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service.api-run will be updated in-place
  ~ resource "google_cloud_run_service" "api-run" {
        id       = "locations/us-central1/namespaces/practice-cicd-mtk/services/api-run"
        name     = "api-run"
        # (3 unchanged attributes hidden)


      ~ template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                  - "run.googleapis.com/sandbox"       = "gvisor"
                } -> null
              - generation  = 0 -> null
              - labels      = {} -> null
            }

          ~ spec {
              - container_concurrency = 80 -> null

                # (1 unchanged block hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service_iam_binding.inference-invoker-binding will be created
  + resource "google_cloud_run_service_iam_binding" "inference-invoker-binding" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + members  = (known after apply)
      + project  = (known after apply)
      + role     = "roles/viewer"
      + service  = "api-run"
    }

  # google_service_account.api-run-service-account will be created
  + resource "google_service_account" "api-run-service-account" {
      + account_id   = "api-run-service-account"
      + display_name = "Service Account for API Cloud Run"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  - project_id     = "projects/practice-cicd-mtk" -> null
  - project_number = "608639825831" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marltake, Action: `pull_request`, Working Directory: ``, Workflow: `terraform CI/CD`*